app/Controllers/CartController.php

    public function addToCart()
{
    if ($this->request->isAJAX()) {
        $session = session();
        $productId = $this->request->getPost('product_id');
        $qty = $this->request->getPost('qty');
        $userId = $session->get('user_id') ?? 1;

        $productModel = new ProductModel();
        $cartModel = new CartModel();

        $product = $productModel->find($productId);

        if ($product) {
            $existingCartItem = $cartModel->where([
                'user_id' => $userId,
                'product_id' => $productId
            ])->first();

            if ($existingCartItem) {
                $newQuantity = $existingCartItem['qty'] + $qty;
                $newTotalPrice = $newQuantity * $product['price'];

                $cartModel->update($existingCartItem['id'], [
                    'qty' => $newQuantity,
                    'total_price' => $newTotalPrice,
                ]);
            } else {
                $cartModel->insert([
                    'user_id' => $userId,
                    'product_id' => $productId,
                    'product_name' => $product['product_name'],
                    'price' => $product['price'],
                    'image' => $product['image'],
                    'qty' => $qty,
                    'total_price' => $product['price'] * $qty,
                ]);
            }

            // Get the updated cart count
            $cartItems = $cartModel->where('user_id', $userId)->findAll();
---
SELECT *
FROM `product`
WHERE `product`.`id` = '6'
SELECT *
FROM `cart`
WHERE `user_id` = 1
AND `product_id` = '6'
 LIMIT 1
UPDATE `cart` SET `qty` = 2, `total_price` = 9000
WHERE `cart`.`id` IN ('53')
INSERT INTO `cart` (`user_id`, `product_id`, `product_name`, `price`, `image`, `qty`, `total_price`) VALUES (1, '3', 'shirt', '4567', 'product4.png', '1', 4567)
SELECT *
FROM `cart`
WHERE `user_id` = 1

    public function displayCart()
    {
        $session = session();
        $cartModel = new CartModel();
        $userId = $session->get('user_id') ?? 1;

        $cart = $cartModel->where('user_id', $userId)->findAll();
---
SELECT *
FROM `cart`
WHERE `user_id` = 1

    public function deleteItem($id)
    {
        $cartModel = new CartModel();

        if ($cartModel->delete($id)) {
            $session = session();
            $userId = $session->get('user_id') ?? 1;

            $cartItems = $cartModel->where('user_id', $userId)->findAll();
---
DELETE FROM `cart`
WHERE `id` IN ('52')
SELECT *
FROM `cart`
WHERE `user_id` = 1

    public function getCartItems()
    {
        $session = session();
        $cartModel = new CartModel();
        $userId = $session->get('user_id') ?? 1; // Replace 1 with dynamic user_id

        $cartItems = $cartModel->where('user_id', $userId)->findAll();
---
SELECT *
FROM `cart`
WHERE `user_id` = 1

    public function placeOrder()
    {
        $session = session();
        $cartModel = new CartModel();
        $orderModel = new OrderModel();
        $orderItemsModel = new OrderItemsModel();

        $validation = $this->validate([
            'fname' => 'required',
            'lname' => 'required',
            'address' => 'required',
            'phone' => 'required|numeric',
            'email' => 'required|valid_email',
            'city' => 'required',
            'total_amt' => 'required|numeric|greater_than[0]',
        ]);

        if (!$validation) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => $this->validator->getErrors(),
            ]);
        }

        $data = $this->request->getPost();
        $userId = $session->get('user_id') ?? 1;

        $data['user_id'] = $userId;

        $orderId = $orderModel->insert($data);

        if ($orderId) {
            $cartItems = $cartModel->where('user_id', $userId)->findAll();

            foreach ($cartItems as $item) {
                $orderItemsModel->insert([
                    'order_id' => $orderId,
                    'product_id' => $item['product_id'],
                    'product_name' => $item['product_name'],
                    'price' => $item['price'],
                    'quantity' => $item['qty'],
                    'total_price' => $item['total_price'],
                ]);
            }

            $cartModel->where('user_id', $userId)->delete();
---
INSERT INTO `order` (`fname`, `lname`, `address`, `phone`, `email`, `city`, `notes`, `total_amt`) VALUES ('komal', 'dgfghfgh', 'katargam', '12345678', 'admin@gmail.com', 'Surat', 'hi', '4020.00')
SELECT *
FROM `cart`
WHERE `user_id` = 1
INSERT INTO `order_item` (`order_id`, `product_id`, `product_name`, `price`, `quantity`, `total_price`) VALUES (102, '1', 'T-shirt', '2000', '2', '4000')
DELETE FROM `cart`
WHERE `user_id` = 1

    public function getCartCount()
    {
        $session = session();
        $cartModel = new CartModel();
        $userId = $session->get('user_id') ?? 1;

        // Get cart items for the user
        $cartItems = $cartModel->where('user_id', $userId)->findAll();
---
SELECT *
FROM `cart`
WHERE `user_id` = 1