app/Controllers/MainController.php

SELECT *
FROM `product`
---
    public function index()
    {
        $model = new ProductModel();
    $data['products'] = $model->findAll();