app/Controllers/PayPalController.php

INSERT INTO `transactions` (`order_id`, `transaction_id`, `payment_status`, `payment_method`, `created_at`) VALUES ('103', 'PAYID-M5XEXHI7M613468X1275973B', 'pending', 'paypal', '2024-12-27 06:39:25')
---


            $transactionModel = new TransactionModel();
            $transactionModel->insert([
                'order_id' => $order_id,
                'transaction_id' => $payment->getId(),
                'payment_status' => 'pending',
                'payment_method' => 'paypal',
                'created_at' => date('Y-m-d H:i:s'),
            ]);