app/Controllers/ProductsController.php

    private function getCategories()
    {
        $model = new ProductModel();
        return $model->distinct()->select('category')->findAll();
---
SELECT DISTINCT `category`
FROM `product`