app/Models/OrderModel.php

    public function getLatestOrder()
    {
        return $this->orderBy('id', 'DESC')->first();
---
SELECT *
FROM `order`
ORDER BY `id` DESC
 LIMIT 1