app/Models/ProductModel.php

SELECT *
FROM `product`
 LIMIT 6, 3
---
    public function getProducts($category = null, $search = null, $perPage = 3, $offset = 0)
    {
        $builder = $this->builder();

        // Filter by category
        if ($category) {
            $builder->where('category', $category);
        }

        // Filter by search term
        if ($search) {
            $builder->like('product_name', $search);
        }

        // Pagination
        $builder->limit($perPage, $offset);

        return $builder->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `product`
---
    public function getProductCount($category = null, $search = null)
    {
        $builder = $this->builder();

        // Filter by category
        if ($category) {
            $builder->where('category', $category);
        }

        // Filter by search term
        if ($search) {
            $builder->like('product_name', $search);
        }

        return $builder->countAllResults();