app/Models/TransactionModel.php

UPDATE `transactions` SET `payment_status` = 'completed', `transaction_id` = '73Y805278G269171N'
WHERE `transaction_id` = 'PAYID-M5XESCA87A22321FH319372Y'
---
    public function updateStatus($paymentId, $data)
    {
        return $this->where('transaction_id', $paymentId)
                    ->set($data)
                    ->update();